app/Controllers/Pribadi/Transaksi.php

    public function index()
    {
        // Mengambil data transaksi dari database
        $transaksi = $this->transaksiModel->findAll();

        // Mengambil data kategori transaksi dari database
        $kategori_transaksi = $this->kategoriTransaksiModel->findAll();

        // Mengambil data saldo pribadi untuk ditampilkan
        $saldo = $this->db->table('saldo_pribadi')->get()->getRow();
---
SELECT *
FROM `transaksi`
SELECT *
FROM `kategori_transaksi`
SELECT *
FROM `saldo_pribadi`