app/Controllers/Master/Produk.php

    public function index()
    {
        $data['produk'] = $this->produkModel->findAll();
---
SELECT *
FROM `produk`

    public function store()
    {
        $this->produkModel->save([
            'nama_produk' => $this->request->getPost('nama_produk'),
            'kategori'    => $this->request->getPost('kategori'),
            'harga_beli'  => $this->request->getPost('harga_beli'),
            'harga_jual'  => $this->request->getPost('harga_jual'),
            'stok'        => $this->request->getPost('stok'),
            'deskripsi'   => $this->request->getPost('deskripsi'),
        ]);
---
INSERT INTO `produk` (`nama_produk`, `kategori`, `harga_beli`, `harga_jual`, `stok`, `deskripsi`, `created_at`, `updated_at`) VALUES ('Capcut Sharing 1 Bulan', 'Apps Premium', '8000', '20000', NULL, NULL, '2025-04-23 14:40:26', '2025-04-23 14:40:26')