app/Controllers/Transaksi/Pengeluaran.php

SELECT *
FROM `pengeluaran`
---
    public function index()
    {
        $data['pengeluaran'] = $this->pengeluaranModel->findAll();