app/Controllers/Transaksi/Penjualan.php

    public function index()
    {
        $penjualanModel = new PenjualanModel();
        $produkModel = new ProdukModel();

        $data = [
            'penjualan' => $penjualanModel->findAll(),
            'produk' => $produkModel->findAll()
        ];
---
SELECT *
FROM `penjualan`
SELECT *
FROM `produk`

    public function create()
    {
        // Ambil data produk dari form
        $produk = $this->request->getPost('produk_id');  // Produk ID
        $qty = $this->request->getPost('qty');  // Jumlah

        // Debug untuk melihat data yang diterima
        // dd($produk, $qty);

        // Cek jika produk kosong atau tidak sesuai
        if (empty($produk) || !is_array($produk)) {
            return redirect()->back()->with('error', 'Data produk tidak ditemukan!');
        }

        $tanggal = $this->request->getPost('tanggal');
        $keterangan = $this->request->getPost('keterangan');
        $metode_pembayaran = $this->request->getPost('metode_pembayaran');

        $total = 0;
        $total_modal = 0;

        // Loop untuk setiap produk yang dipilih
        foreach ($produk as $key => $prod_id) {
            // Ambil data produk dari database
            $prod = $this->produkModel->find($prod_id);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '9'


        // Simpan detail produk penjualan
        foreach ($produk as $key => $prod_id) {
            $prod = $this->produkModel->find($prod_id);
            if ($prod) {
                $this->detailPenjualanModel->insert([
                    'penjualan_id' => $penjualan_id,
                    'produk_id' => $prod_id,
                    'harga' => $prod['harga_jual'],
                    'jumlah' => $qty[$key],
                    'subtotal' => $prod['harga_jual'] * $qty[$key]
                ]);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '9'
INSERT INTO `detail_penjualan` (`penjualan_id`, `produk_id`, `harga`, `jumlah`, `subtotal`) VALUES (150008, '9', '16000.00', '1', 16000)