app/Controllers/Home.php

    public function index()
    {
        // Hitung Total Penjualan
        $totalPenjualan = $this->penjualanModel->selectSum('total')->selectSum('keuntungan')->first();
        $totalKeuntungan = $totalPenjualan ? $totalPenjualan['keuntungan'] : 0;
        $totalPenjualan = $totalPenjualan ? $totalPenjualan['total'] : 0;


        // Hitung Jumlah Produk Terjual
        $jumlahProdukTerjual = $this->detailPenjualanModel->selectSum('jumlah')->first();
        $jumlahProdukTerjual = $jumlahProdukTerjual ? $jumlahProdukTerjual['jumlah'] : 0;

        // Hitung Total Pengeluaran
        $totalPengeluaran = $this->pengeluaranModel->selectSum('jumlah')->first();
        $totalPengeluaran = $totalPengeluaran ? $totalPengeluaran['jumlah'] : 0;

        // Ambil data sebelumnya untuk perbandingan (misalnya dari bulan lalu)
        $previousData = $this->getPreviousData();

        // Persentase perubahan
        $persenPenjualan = $this->calculatePercentage($totalPenjualan, $previousData['penjualan']);
        $persenKeuntungan = $this->calculatePercentage($totalKeuntungan, $previousData['keuntungan']);
        $persenPengeluaran = $this->calculatePercentage($totalPengeluaran, $previousData['pengeluaran']);

        // Menghitung perubahan (peningkatan)
        $extraPenjualan = $totalPenjualan - $previousData['penjualan'];
        $extraKeuntungan = $totalKeuntungan - $previousData['keuntungan'];
        $extraPengeluaran = $totalPengeluaran - $previousData['pengeluaran'];

        // Data history 10 terakhir (gabung dari 2 tabel)
        $riwayatPenjualan = $this->penjualanModel->select("'penjualan' as jenis, total as jumlah, tanggal, keuntungan")
            ->orderBy('tanggal', 'DESC')
            ->findAll(10);

        $riwayatPengeluaran = $this->pengeluaranModel->select(" 'pengeluaran' AS jenis, jumlah, tanggal, (jumlah * -1) AS keuntungan ")
                            ->orderBy('tanggal', 'DESC')
                            ->findAll(10);
---
SELECT SUM(`total`) AS `total`, SUM(`keuntungan`) AS `keuntungan`
FROM `penjualan`
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `detail_penjualan`
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `pengeluaran`
 LIMIT 1
SELECT 'penjualan' as jenis, `total` as `jumlah`, `tanggal`, `keuntungan`
FROM `penjualan`
ORDER BY `tanggal` DESC
 LIMIT 10
SELECT 'pengeluaran' AS jenis, `jumlah`, `tanggal`, (jumlah * -1) AS keuntungan
FROM `pengeluaran`
ORDER BY `tanggal` DESC
 LIMIT 10

        $riwayatGabung = array_slice($riwayatGabung, 0, 10);


        $saldoToko = $this->db->table('saldo_store')->get()->getRow()->saldo;
        $saldoPribadi = $this->db->table('saldo_pribadi')->get()->getRow()->saldo;; // Misalnya saldo pribadi bisa disesuaikan dari data lainnya
---
SELECT *
FROM `saldo_store`
SELECT *
FROM `saldo_pribadi`

    private function getPreviousData()
    {
        // Ambil total penjualan bulan lalu
        $previousPenjualan = $this->penjualanModel
                                ->where('MONTH(tanggal)', date('m') - 1)
                                ->selectSum('total')
                                ->first();
        $previousPenjualan = $previousPenjualan ? $previousPenjualan['total'] : 0;

        // Ambil keuntungan bulan lalu
        $previousKeuntungan = $this->penjualanModel
                            ->selectSum('keuntungan')
                            ->where('MONTH(tanggal)', date('m') - 1)
                            ->first();
        $previousKeuntungan = $previousKeuntungan ? $previousKeuntungan['keuntungan'] : 0;



        // Ambil total pengeluaran bulan lalu
        $previousPengeluaran = $this->pengeluaranModel
                                    ->where('MONTH(tanggal)', date('m') - 1)
                                    ->selectSum('jumlah')
                                    ->first();
---
SELECT SUM(`total`) AS `total`
FROM `penjualan`
WHERE MONTH(tanggal) = 3
 LIMIT 1
SELECT SUM(`keuntungan`) AS `keuntungan`
FROM `penjualan`
WHERE MONTH(tanggal) = 3
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `pengeluaran`
WHERE MONTH(tanggal) = 3
 LIMIT 1

    public function getData()
    {
        $type = $this->request->getGet('type'); // 'month' or 'year'

        $db = \Config\Database::connect();

        if ($type === 'month') {
            // Ambil data penjualan per hari bulan ini
            $builder = $db->table('penjualan')
                ->select("DAY(tanggal) as label, SUM(total) as total, SUM(keuntungan) as keuntungan")
                ->where("MONTH(tanggal)", date('m'))
                ->where("YEAR(tanggal)", date('Y'))
                ->groupBy("DAY(tanggal)")
                ->orderBy("DAY(tanggal)");

            $penjualanData = $builder->get()->getResultArray();

            $pengeluaranData = $db->table('pengeluaran')
                ->select("DAY(tanggal) as label, SUM(jumlah) as jumlah")
                ->where("MONTH(tanggal)", date('m'))
                ->where("YEAR(tanggal)", date('Y'))
                ->groupBy("DAY(tanggal)")
                ->orderBy("DAY(tanggal)")
                ->get()->getResultArray();
---
SELECT DAY(tanggal) as label, SUM(total) as total, SUM(keuntungan) as keuntungan
FROM `penjualan`
WHERE MONTH(tanggal) = '04'
AND YEAR(tanggal) = '2025'
GROUP BY DAY(tanggal)
ORDER BY DAY(tanggal)
SELECT DAY(tanggal) as label, SUM(jumlah) as jumlah
FROM `pengeluaran`
WHERE MONTH(tanggal) = '04'
AND YEAR(tanggal) = '2025'
GROUP BY DAY(tanggal)
ORDER BY DAY(tanggal)