app/Controllers/Home.php

    private function getPreviousData()
    {
        // Ambil total penjualan bulan lalu
        $previousPenjualan = $this->penjualanModel
                                ->where('MONTH(tanggal)', date('m') - 1)
                                ->selectSum('total')
                                ->first();
        $previousPenjualan = $previousPenjualan ? $previousPenjualan['total'] : 0;

        // Ambil keuntungan bulan lalu
        $previousKeuntungan = $this->penjualanModel
                            ->selectSum('keuntungan')
                            ->where('MONTH(tanggal)', date('m') - 1)
                            ->first();
        $previousKeuntungan = $previousKeuntungan ? $previousKeuntungan['keuntungan'] : 0;



        // Ambil total pengeluaran bulan lalu
        $previousPengeluaran = $this->pengeluaranModel
                                    ->where('MONTH(tanggal)', date('m') - 1)
                                    ->selectSum('jumlah')
                                    ->first();
---
SELECT SUM(`total`) AS `total`
FROM `penjualan`
WHERE MONTH(tanggal) = 3
 LIMIT 1
SELECT SUM(`keuntungan`) AS `keuntungan`
FROM `penjualan`
WHERE MONTH(tanggal) = 3
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `pengeluaran`
WHERE MONTH(tanggal) = 3
 LIMIT 1